# Гайд по командам управления игроками

## Общая информация

В этом руководстве описаны команды для управления игроками. Вы узнаете, как замораживать, размораживать, банить и разбанивать игроков, а также как отправлять сообщения и получать информацию о состоянии игры.

## Команды

### Получение информации

- **info** - Получить информацию о состоянии игры.
  ```
  Пример:
  > info
  Общее количество инопланетян 0
  Общее количество астероидов 0
  Общее количество игроков 1
  Забаненные игроки: None
  Игроки и их индексы
  Индекс: 0, Имя: LⓄV☆ ❤️Julia❤️ , Тип корабля: 101
  Координаты: X: 552, Y: -789
  ```

### Заморозка и разморозка игрока

- **idle(index)** - Заморозить игрока.
  ```
  Пример:
  > idle(0)
  Игрок LⓄV☆ ❤️Julia❤️ , индекс 0, был заморожен.
  ```

- **unidle(index)** - Разморозить игрока.
  ```
  Пример:
  > unidle(0)
  Игрок LⓄV☆ ❤️Julia❤️ , индекс 0, был разморожен.
  ```

### Бан и разбан игрока

- **ban(index)** - Забанить игрока.
  ```
  Пример:
  > ban(0)
  Игрок: LⓄV☆ ❤️Julia❤️ , индекс: 0 был заблокирован.
  ```

- **banlist** - Список забаненных игроков.
  ```
  Пример:
  > banlist
  Список забаненных игроков:
  Количество: 1
  Индекс: 0, Имя: LⓄV☆ ❤️Julia❤️, Причина: Нету
  ```

- **unban(index)** - Разбанить игрока.
  ```
  Пример:
  > unban(0)
  Игрок LⓄV☆ ❤️Julia❤️ , индекс 0, был разбанен.
  ```

### Спектатор

- **spect(index)** - Сделать игрока спектатором.
  ```
  Пример:
  > spect(0)
  Игрок: LⓄV☆ ❤️Julia❤️ стал спектатором.
  ```

- **spect(index)** - Проверка, является ли игрок уже спектатором.
  ```
  Пример:
  > spect(0)
  Игрок: LⓄV☆ ❤️Julia❤️ уже является спектатором.
  ```

### Отправка сообщений

- **say(text, size, color)** - Отправить сообщение.
  ```
  Пример:
  > say("12341234", 10 ,"#ffd700")
  Текст: "12341234" отправлен, Цвет: #ffd700
  ```

### Управление модом

- **start** - Запустить мод.
  ```
  Пример:
  > start
  Code initialization took 1ms
  Mod started
  https://starblast.io#7710@195.201.89.106:3034
  Use 'test' to open game frame for testing
  ```

- **stop** - Остановить мод.
  ```
  Пример:
  > stop
  Mod stopped
  ```

## Примеры использования

1. **Заморозка и разморозка игрока:**
   ```
   > idle(0)
   Игрок LⓄV☆ ❤️Julia❤️ , индекс 0, был заморожен.
   
   > unidle(0)
   Игрок LⓄV☆ ❤️Julia❤️ , индекс 0, был разморожен.
   ```

2. **Бан и разбан игрока:**
   ```
   > ban(0)
   Игрок: LⓄV☆ ❤️Julia❤️ , индекс: 0 был заблокирован.
   
   > banlist
   Список забаненных игроков:
   Количество: 1
   Индекс: 0, Имя: LⓄV☆ ❤️Julia❤️, Причина: Нету
   
   > unban(0)
   Игрок LⓄV☆ ❤️Julia❤️ , индекс 0, был разбанен.
   ```

3. **Спектатор:**
   ```
   > spect(0)
   Игрок: LⓄV☆ ❤️Julia❤️ стал спектатором.
   
   > spect(0)
   Игрок: LⓄV☆ ❤️Julia❤️ уже является спектатором.
   ```

4. **Отправка сообщения:**
   ```
   > say("12341234", 10 ,"#ffd700")
   Текст: "12341234" отправлен, Цвет: #ffd700
   ```

5. **Получение информации об игре:**
   ```
   > info
   Общее количество инопланетян 0
   Общее количество астероидов 0
   Общее количество игроков 1
   Забаненные игроки: None
   Игроки и их индексы
   Индекс: 0, Имя: LⓄV☆ ❤️Julia❤️ , Тип корабля: 101
   Координаты: X: 552, Y: -789
   ```

6. **Управление модом:**
   ```
   > start
   Code initialization took 1ms
   Mod started
   https://starblast.io#7710@195.201.89.106:3034
   Use 'test' to open game frame for testing
   
   > stop
   Mod stopped
   ```

